{
    "produtos": [
        {
            "id": 1,
            "titulo": "Caneca StormTrooper",
            "categoria": "star wars",
            "preco": "R$ 30,00",
            "descricao": "Desperte a força do seu café da manhã com esta incrível caneca temática do Stormtrooper. Feita de cerâmica de alta qualidade, esta caneca apresenta um design detalhado e autêntico do icônico soldado do Império Galáctico. Perfeita para fãs de Star Wars e colecionadores, é também uma excelente opção de presente para qualquer entusiasta da saga.",
            "imageURL": "https://source.unsplash.com/6FDXGY9J6y4"
        },
        {
            "id": 2,
            "titulo": "Lego Darth Vader/Dark Trooper",
            "categoria": "star wars",
            "preco": "R$ 80,00",
            "descricao": "Reviva a batalha épica entre o bem e o mal com este conjunto LEGO exclusivo do Darth Vader e Dark Trooper. Construa e recrie suas cenas favoritas de Star Wars com esses detalhados personagens. O conjunto inclui peças e instruções fáceis de seguir para montagem. Ideal para fãs de todas as idades e colecionadores de LEGO.",
            "imageURL": "https://source.unsplash.com/epRFE_hBNjo"
        },
        {
            "id": 3,
            "titulo": "Action Figure Mestre Yoda",
            "categoria": "star wars",
            "preco": "R$ 49,90",
            "descricao": "Sinta a sabedoria e o poder da Força com esta action figure detalhada do Mestre Yoda. Com aproximadamente 15 cm de altura, esta figura articulada permite que você posicione o Yoda em várias poses emblemáticas. Seja para brincar ou colecionar, esta figura é essencial para qualquer fã de Star Wars e entusiasta de action figures.",
            "imageURL": "https://i.pinimg.com/564x/4d/cf/b0/4dcfb0ba28f8223f8578407a4c29de00.jpg"
        },
        {
            "id": 4,
            "titulo": "Action Figure StormTrooper",
            "categoria": "star wars",
            "preco": "R$ 49,90",
            "descricao": "Lidere as fileiras do Império com esta action figure do Stormtrooper. Com design autêntico e articulações móveis, este boneco permite que você recrie batalhas épicas e cenas de ação emocionantes. Seja parte da legião imperial e adicione este item à sua coleção de action figures de Star Wars.",
            "imageURL": "https://source.unsplash.com/4OHkK555s1A"
        },
        {
            "id": 5,
            "titulo": "Pelúcia Baby Yoda",
            "categoria": "star wars",
            "preco": "R$ 75,00",
            "descricao": "Conheça o adorável Baby Yoda em forma de pelúcia! Inspirado na série \"The Mandalorian\", esta pelúcia captura a ternura e a fofura do personagem amado por todos. Feita com materiais de alta qualidade e extremamente macia ao toque, é a companhia perfeita para fãs de todas as idades.",
            "imageURL": "https://source.unsplash.com/R8L1l9RN198"
        },
        {
            "id": 6,
            "titulo": "Action Figure Kylo Ren",
            "categoria": "star wars",
            "preco": "R$ 49,90",
            "descricao": "Entre no lado sombrio com esta action figure do Kylo Ren. Com detalhes excepcionais, esta figura articulada permite que você recrie momentos cruciais da trilogia sequela de Star Wars. Seja para colecionar ou exibir, esta figura é um imperdível para os seguidores da saga.",
            "imageURL": "https://source.unsplash.com/1VV1MRafd7A"
        },
        {
            "id": 7,
            "titulo": "Controle Xbox Series",
            "categoria": "console",
            "preco": "R$ 200,00",
            "descricao": "Domine o jogo com o controle Xbox Series X. Projetado ergonomicamente para conforto durante horas de jogo, este controle oferece precisão e resposta rápida. Compatível com o console Xbox Series X e outros dispositivos compatíveis, este é o controle ideal para os jogadores mais exigentes.",
            "imageURL": "https://source.unsplash.com/OitYIbHSyWU"
        },
        {
            "id": 8,
            "titulo": "Playstation 5",
            "categoria": "console",
            "preco": "R$ 4.299,90",
            "descricao": "Descubra a próxima geração do entretenimento com o Playstation 5. Com gráficos impressionantes, tempos de carregamento ultrarrápidos e recursos inovadores, o PS5 levará sua experiência de jogo a um novo patamar. Seja você um jogador casual ou hardcore, este console é o futuro do entretenimento digital.",
            "imageURL": "https://source.unsplash.com/caNzzoxls8Q"
        },
        {
            "id": 9,
            "titulo": "Nintendo CLássico",
            "categoria": "console",
            "preco": "R$ 2000,00",
            "descricao": "Reviva a nostalgia dos jogos retrô com o Nintendo Clássico. Este console compacto apresenta uma seleção de jogos clássicos incorporados, proporcionando horas de diversão para jogadores de todas as idades. Seja você um jogador antigo ou novo para os clássicos, o Nintendo Clássico é uma escolha excepcional.",
            "imageURL": "https://source.unsplash.com/4GWI7PW9_44"
        },
        {
            "id": 10,
            "titulo": "Controles Switch",
            "categoria": "console",
            "preco": "R$ 350,00",
            "descricao": "Aproveite ao máximo sua experiência de jogo no Nintendo Switch com esses controles adicionais. Com design elegante e confortável, esses controles são fáceis de usar e permitem jogar com amigos e familiares. Adicione mais jogadores à ação e mergulhe nos seus jogos favoritos do Switch.",
            "imageURL": "https://source.unsplash.com/wa5z9o9fgjw"
        },
        {
            "id": 11,
            "titulo": "Xbox Series X",
            "categoria": "console",
            "preco": "R$ 3.900,00",
            "descricao": "Mergulhe no poder do Xbox Series X, o console de próxima geração que oferece gráficos incríveis, carregamento rápido e uma biblioteca impressionante de jogos. Experimente ação de tirar o fôlego, aventuras épicas e jogos multijogador online como nunca antes. O Xbox Series X é a escolha definitiva para jogadores apaixonados.",
            "imageURL": "https://source.unsplash.com/DPOdCl4bGJU"
        },
        {
            "id": 12,
            "titulo": "GameBoy Color",
            "categoria": "console",
            "preco": "R$ 330,00",
            "descricao": "Volte no tempo com o clássico GameBoy Color. Este console portátil icônico permite que você jogue seus jogos favoritos em 8 bits em qualquer lugar que vá. Com uma tela colorida, é a maneira perfeita de reviver os momentos nostálgicos da sua infância e aproveitar uma ampla variedade de jogos clássicos.",
            "imageURL": "https://i.pinimg.com/564x/f0/a3/36/f0a3366a77883ad048ce9674dfdd52d3.jpg"
        },
        {
            "id": 13,
            "titulo": "Camiseta Atari",
            "categoria": "roupas, console",
            "preco": "R$ 70,00",
            "descricao": "Mostre seu amor pela era dos jogos clássicos com esta camiseta Atari estilosa. Com o logotipo icônico da Atari estampado na frente, esta camiseta é perfeita para fãs de jogos retrô e entusiastas da história dos videogames.",
            "imageURL": "https://i.pinimg.com/564x/86/0d/6a/860d6a6d0950438b6b5b0a6e0bc9457d.jpg"
        },
        {
            "id": 14,
            "titulo": "Camiseta SNES",
            "categoria": "roupas, console",
            "preco": "R$ 70,00",
            "descricao": "Celebre o legado do Super Nintendo com esta camiseta SNES. Apresentando o design do clássico console de 16 bits, esta camiseta é uma homenagem aos jogos e personagens que cativaram gerações de jogadores. Seja nostálgico com estilo usando esta camiseta retrô.",
            "imageURL": "https://i.pinimg.com/564x/c3/c2/99/c3c299e3db39e2224ab37bdec6e11fb8.jpg"
        },
        {
            "id": 15,
            "titulo": "Camiseta Darth Vader",
            "categoria": "roupas, star wars",
            "preco": "R$ 70,00",
            "descricao": "Abra espaço para o lado sombrio com esta camiseta do Darth Vader. Com a imagem imponente do vilão de Star Wars estampada, esta camiseta é perfeita para fãs do Império e da saga espacial. Mostre seu amor por Star Wars com orgulho usando esta camiseta.",
            "imageURL": "https://i.pinimg.com/736x/64/e3/30/64e33027f158cd6cf35ec5bf2ef640b1.jpg"
        },
        {
            "id": 16,
            "titulo": "Camiseta Marvel",
            "categoria": "roupas",
            "preco": "R$ 70,00",
            "descricao": "Se você é fã da Marvel com certeza precisa dessa camiseta com a logo mais famosa dos quadrinhos estampada na frente. Uma marca que inspira gerações e uma verdadeira fábrica de heróis e vilões, vista-se com uma das maiores produtoras de quadrinhos do mundo",
            "imageURL": "https://source.unsplash.com/DaMkKmlloc0"
        },
        {
            "id": 17,
            "titulo": "Camiseta Mario Bross",
            "categoria": "roupas",
            "preco": "R$ 70,00",
            "descricao": "Traga a magia do Reino do Cogumelo para o seu guarda-roupa com esta camiseta do Mario Bros. Com uma estampa vibrante do icônico encanador da Nintendo, esta camiseta é um must-have para fãs de longa data e novos jogadores do universo Mario.",
            "imageURL": "https://i.pinimg.com/originals/54/8d/8b/548d8bef3ae304761c8d135944eaaca8.jpg"
        },
        {
            "id": 18,
            "titulo": "Camiseta Naruto",
            "categoria": "roupas",
            "preco": "R$ 70,00",
            "descricao": "Canalize a determinação do ninja mais amado com esta camiseta do Naruto. Com uma estampa estilizada do personagem principal, esta camiseta é uma homenagem a uma das séries de anime mais aclamadas do mundo.",
            "imageURL": "https://i.pinimg.com/564x/3f/81/a0/3f81a0895f85e9d7316c113be8b3f04d.jpg"
        },
        {
            "id": 19,
            "titulo": "Nintendo Switch Lite",
            "categoria": "oferta, console",
            "preco": "<s>R$ 1800,00</s><br> R$ 1400,00",
            "descricao": "Apresentamos o Nintendo Switch Lite, uma nova versão do console Nintendo Switch que foi otimizado para o jogo pessoal e portátil. Compatível com todos os jogos digitais ou em mídia física para o Nintendo Switch que possuam modo portátil.",
            "imageURL": "https://source.unsplash.com/74kYIbjljDA"
        },
        {
            "id": 20,
            "titulo": "Playstation 4",
            "categoria": "oferta, console",
            "preco": "<s>R$ 28000,00</s> <br>R$ 1960,00",
            "descricao": "Com seu console PlayStation 4 você terá entretenimento garantido todos os dias. Sua tecnologia foi criada para colocar novos desafios para jogadores novatos e especialistas. Com o console PlayStation 4, líder mundial de vendas por anos, você poderá desfrutar de horas de jogo e excelente navegabilidade para desfrutar de filmes, séries e conteúdo online",
            "imageURL": "https://source.unsplash.com/mwytIca3qNA"
        },
        {
            "id": 21,
            "titulo": "Camiseta Star Wars",
            "categoria": "oferta, roupas, star wars",
            "preco": "<s>R$ 49,00</s> <br>R$ 39,00",
            "descricao": "Mostre sua devoção à galáxia muito, muito distante com esta camiseta Star Wars. Estampada com a logo clássica exibida em todos os filmes da saga, esta camiseta é uma adição incrível para o seu guarda-roupa.",
            "imageURL": "https://images.tcdn.com.br/img/img_prod/723087/camiseta_star_wars_logo_8165_1_216d07bf81585c9a23a12c0a3924c619.png"
        },
        {
            "id": 22,
            "titulo": "Camiseta Playstation",
            "categoria": "oferta, roupas, console",
            "preco": "<s>R$ 49,00</s><br> R$ 39,00",
            "descricao": "Exiba sua paixão pelos jogos com esta camiseta Playstation. Com o logotipo reconhecível da marca estampado na frente, esta camiseta é uma escolha elegante e confortável para os fãs leais da plataforma de jogos. Seja você um jogador casual ou hardcore, esta camiseta é perfeita para mostrar seu orgulho gamer.",
            "imageURL": "https://www.camisetas4fun.com.br/media/product/05f/camiseta-playstation-6bd.jpg"
        },
        {
            "id": 23,
            "titulo": "Action Figure Luke Skywalker",
            "categoria": "oferta, star wars",
            "preco": "<s>R$ 70,00</s><br> R$ 46,90",
            "descricao": "Recrie as emocionantes batalhas das estrelas com esta action figure detalhada do Luke Skywalker. Inspirado na clássica trilogia de Star Wars, este boneco articulado permite que você viva aventuras galácticas e cenas emblemáticas do herói. Com sua capa, sabre de luz e acessórios, esta figura é um must-have para qualquer coleção de Star Wars.",
            "imageURL": "https://c1-ebgames.eb-cdn.com.au/merchandising/images/packshots/2793dc5bb68a428db1f4334e59e01209_Original.jpg"
        },
        {
            "id": 24,
            "titulo": "Action Figure Iron Man",
            "categoria": "oferta",
            "preco": "<s>R$ 70,00</s><br> R$ 46,90",
            "descricao": "Prepare-se para salvar o mundo com esta action figure do Iron Man. Inspirada nos filmes da Marvel, esta figura articulada permite que você entre na pele do poderoso Tony Stark e crie suas próprias batalhas épicas. Com detalhes impressionantes e acessórios adicionais, esta figura é um item indispensável para fãs dos Vingadores e do Universo Cinematográfico Marvel.",
            "imageURL": "https://images.yampi.me/assets/stores/minidengo/uploads/images/action-figure-homem-de-ferro-iron-man-mark-mk7-a-mk7-a-boxed-60f1af313b0d8-large.jpg"
        }
    ]
}